# 3 ДОМАШНЕЕ ЗАДАНИЕ

# Задача 16:
# Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N].
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве.
# В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X.


# import random
#
# N = int(input("Введите число N - "))
# list_1 = [random.randint(1, 20) for i in range(N)]
# print("Введеный массив - ", list_1)
# array = list(map(int, list_1))
# X = int(input("Введите число X - "))
# count = 0
# for i in range(N):
#     if array[i] == X:
#         count += 1
# print(f"Число {X} встречается в списке А {count} раз.")


# Задача 18:
# Требуется найти в массиве A[1..N] самый близкий по величине элемент к заданному числу X.
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве.
# В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X


# import random
#

# N = int(input("Введите число N - "))
# list_1 = [random.randint(1, 20) for i in range(N)]
# print("Массив - ", list_1)
# x = int(input("Введите число X - "))
# count = 0
# min_number = abs(x - list_1[0])
# for i in range(1, N):
#     time_number = abs(x - list_1[i])
#     if time_number < min_number:
#         min_number = time_number
#         count = i
# print(f"Самый близкий по величине элемент к заданному числу {list_1[count]}")



# Задача 20:
# В настольной игре Скрабл (Scrabble) каждая буква имеет определенную ценность.
# В случае с английским алфавитом очки распределяются так:

# A, E, I, O, U, L, N, S, T, R – 1 очко;
# D, G – 2 очка;
# B, C, M, P – 3 очка;
# F, H, V, W, Y – 4 очка;
# K – 5 очков;
# J, X – 8 очков;
# Q, Z – 10 очков

# А русские буквы оцениваются так:
# А, В, Е, И, Н, О, Р, С, Т – 1 очко;
# Д, К, Л, М, П, У – 2 очка;
# Б, Г, Ё, Ь, Я – 3 очка;
# Й, Ы – 4 очка;
# Ж, З, Х, Ц, Ч – 5 очков;
# Ш, Э, Ю – 8 очков;
# Ф, Щ, Ъ – 10 очков.

# Напишите программу, которая вычисляет стоимость введенного пользователем слова.
# Будем считать, что на вход подается только одно слово,
# которое содержит либо только английские, либо только русские буквы.

list_letters = {1:"AEIOULNSTRАВЕИНОРСТ",
                2:"DGДКЛМПУ",
                3:"BCMPБГЁЬЯ",
                4:"FHVWYЙЫ",
                5:"KЖЗХЦЧ",
                8:"JXШЭЮ",
                10:"QZФЩЪ"}

word = input("Введите слово: ").upper()
summ = 0
for i in word:
    for k, v in list_letters.items():
        if i in v:
            summ += k
print(f"Стоимость слова: {summ}")